{
  "cells": [
    {
      "cell_type": "markdown",
      "id": "01ac01fe",
      "metadata": {
        "id": "01ac01fe"
      },
      "source": [
        "## Домашнее задание 2\n",
        "### Описание\n",
        "Вам предстоит решить две задачи. При решении можно пользоваться **только базовыми функциями Python**.\n",
        "\n",
        "### Задача 1 (6 баллов)\n",
        "\n",
        "Вам необходимо понять, какие слова встречаются в текстах на русском языке чаще всего. Программе на вход подаётся текст (одной строкой). Ваша задача:\n",
        "\n",
        "- очистить текст от знаков препинания, пробелов, чисел и привести всё к нижнему регистру — *2 балла*;\n",
        "- создать словарь, ключи которого — слова, а значения — то, сколько раз эти слова встречаются во введённом тексте — *4 балла*.\n",
        "\n",
        "**Примечание.** Использование класса `Counter` из модуля `collections` (как и любых других модулей) <u>запрещено</u>.\n",
        "\n",
        "**Пример:**\n",
        "\n",
        "```\n",
        "input:\n",
        "Кроме того, я полагаю, что Карфаген должен быть разрушен.\n",
        "\n",
        "output:\n",
        "{'кроме': 1,\n",
        " 'того': 1,\n",
        " 'я': 1,\n",
        " 'полагаю': 1,\n",
        " 'что': 1,\n",
        " 'карфаген': 1,\n",
        " 'должен': 1,\n",
        " 'быть': 1,\n",
        " 'разрушен': 1}\n",
        "```\n",
        "\n",
        "**Критерии:**\n",
        "\n",
        "См. в условии."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": null,
      "id": "6c16e4c1",
      "metadata": {
        "id": "6c16e4c1"
      },
      "outputs": [],
      "source": [
        "# ваш код здесь\n",
        "ster  = input()\n",
        "\n",
        "# Убираем числа\n",
        "ster1 = ''.join([i for i in ster if not i.isdigit()])\n",
        "\n",
        "# Убираем пробелы и знаки препинания.\n",
        "ster2 = ster1\n",
        "symbols_list = [\".\", \",\", \"!\", \"(\", \")\", \"?\", \"-\", \":\", \";\", \"  \"]\n",
        "for i in symbols_list:\n",
        "    ster2 = ster2.replace(i, \"\")\n",
        "    if i == \"  \":\n",
        "        ster2 = ster2.replace(i, \" \")\n",
        "\n",
        "# Приводим к нижнему регистру. Создаём список.\n",
        "lis = ster2.strip().replace(\" \", \",\").lower().split(\",\")\n",
        "\n",
        "# Создаём словарь\n",
        "dictionary_1 = dict(zip(lis, map(lambda x: lis.count(x), lis)))\n",
        "\n",
        "print(dictionary_1)"
      ]
    },
    {
      "cell_type": "markdown",
      "id": "7ce4c7d3",
      "metadata": {
        "id": "7ce4c7d3"
      },
      "source": [
        "### Задача 2 (10 баллов)\n",
        "\n",
        "Вы участвуете в организации эксперимента и пишете программу, которая принимает на вход данные i-го объекта. Известно, что форматом хранения данных является таблица, где строка соответствует наблюдению (в данном случае — уникальному объекту), а столбец — переменной. Следовательно, в ячейке ij находится значение j-ой переменной (показателя) для i-го наблюдения (объекта). Напишите программу, которая будет принимать на вход по одной такой строке. Программа должна:\n",
        "\n",
        "- принимать на вход разделитель (для элементов строки). Разделителем может быть `','`, `';'` и `' '` — *1 балл*;\n",
        "- принимать на вход названия колонок (переменных) через указанный разделитель. Гарантируется, что разделитель всегда будет корректным — *1 балл*;\n",
        "- принимать на вход типы колонок (переменных) через указанный разделитель; возможные типы — `int`, `float`, `bool`, `str` — *1 балл*;\n",
        "- принимать на вход строки до тех пор, пока на вход не будет подано значение `'TRANSMISSION STOPPED'` — *2 балла*;\n",
        "- если количество элементов в строке не соответствует заявленному ранее, печатать сообщение `'INVALID ELEMENTS NUMBER'` и начинать следующий ввод — *1 балл*;\n",
        "- возвращать и печатать для пользователя словарь, в котором ключами будут названия, а значениями — списки со значениями каждой переменной для каждого объекта. Значения переменной должны быть приведены к соответствующему типу. Гарантируется, что входная спецификация типов корректна — *4 балла*.\n",
        "\n",
        "**Примечание.** Использование модуля `pandas` <u>запрещено</u>.\n",
        "\n",
        "**Пример:**\n",
        "\n",
        "```\n",
        "input:\n",
        "\n",
        "Введите разделитель: ;\n",
        "Введите названия колонок: height;weight;gender\n",
        "Введите типы данных: float;float;str\n",
        "190;84;male\n",
        "160;50;female\n",
        "175;65;male\n",
        "183;100;male\n",
        "TRANSMISSION STOPPED\n",
        "\n",
        "output:\n",
        "\n",
        "{'height': [190.0, 160.0, 175.0, 183.0],\n",
        " 'weight': [84.0, 50.0, 65.0, 100.0],\n",
        " 'gender': ['male', 'female', 'male', 'male']}\n",
        "```\n",
        "\n",
        "**Критерии:**\n",
        "\n",
        "См. в условии."
      ]
    },
    {
      "cell_type": "code",
      "execution_count": 50,
      "id": "bdaa40c4",
      "metadata": {
        "id": "bdaa40c4"
      },
      "outputs": [],
      "source": [
        "# ваш код здесь\n",
        "\n",
        "def tablica():\n",
        "    razdelytel = input(\"Введите разделитель: \")\n",
        "    print(razdelytel)\n",
        "    name_colomes = input(\"Введите названия колонок: \").split(razdelytel)\n",
        "    print(name_colomes)\n",
        "    type_data = input(\"Введите типы данных: \").split(razdelytel)\n",
        "    print(type_data)\n",
        "    stopstring = \"TRANSMISSION STOPPED\"\n",
        "\n",
        "    # ввод данных\n",
        "    data_list = []\n",
        "    while True:\n",
        "        data = input(\"Введите данные: \")\n",
        "        if data == stopstring:\n",
        "            break\n",
        "        if len(data.split(razdelytel)) != 3:\n",
        "            print(\"INVALID ELEMENTS NUMBER\")\n",
        "            continue\n",
        "        data_list.append(data)\n",
        "\n",
        "    # создание вложенных списков\n",
        "    data_list = list(map(lambda x: x.split(razdelytel), data_list))\n",
        "\n",
        "    # разделение по колонкам\n",
        "    that_data = []\n",
        "    for i in range(len(data_list[0])):\n",
        "        data_on_rows = []\n",
        "        for row in data_list:\n",
        "            data_on_rows.append(row[i])\n",
        "        that_data.append(data_on_rows)\n",
        "\n",
        "    # приведение к типу\n",
        "    for i in range(len(that_data)):\n",
        "        if type_data[i] == \"str\":\n",
        "            that_data[i] = list(map(str, that_data[i]))\n",
        "        if type_data[i] == \"int\":\n",
        "            that_data[i] = list(map(int, that_data[i]))\n",
        "        if type_data[i] == \"float\":\n",
        "            that_data[i] = list(map(float, that_data[i]))\n",
        "        if type_data[i] == \"bool\":\n",
        "            that_data[i] = list(map(bool, that_data[i]))\n",
        "\n",
        "    # создание словаря\n",
        "    result = dict(zip(name_colomes, that_data))\n",
        "    return result\n",
        "\n",
        "print(tablica())\n"
      ]
    }
  ],
  "metadata": {
    "kernelspec": {
      "display_name": "Python 3 (ipykernel)",
      "language": "python",
      "name": "python3"
    },
    "language_info": {
      "codemirror_mode": {
        "name": "ipython",
        "version": 3
      },
      "file_extension": ".py",
      "mimetype": "text/x-python",
      "name": "python",
      "nbconvert_exporter": "python",
      "pygments_lexer": "ipython3",
      "version": "3.10.8"
    },
    "colab": {
      "provenance": []
    }
  },
  "nbformat": 4,
  "nbformat_minor": 5
}